20260119231736-sales_growth_meeting_3rd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-30 Mon 14:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sales growth meeting 3rd</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">sales growth meeting 3rd</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc84cd12">Knowing What You Don't Know (KYDK) And Getting The Bare Minimum (GTBM) Best Detail</a>
<ul>
<li><a href="#orgc8be4cb">Introduction</a></li>
<li><a href="#org60a07b2">Understanding Your Knowledge Gaps</a></li>
<li><a href="#orgab68547">How To Get The Bare Minimum Best Detail</a></li>
<li><a href="#orge1878ce">Applying Information Smartly To Current Problems</a></li>
<li><a href="#org6d9c32a">Developing Sales Competence &amp; Soft Skills</a></li>
<li><a href="#orga7a82f4">Boosting Technological Competence</a></li>
<li><a href="#org2b44b5d">Hierarchy Of Problem Solving Based On Details Known</a></li>
<li><a href="#org3c17605">take fast decisions based on the current set of available set of information. and keep on adapting as the situation unfolds and gives more details to the current problem.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc84cd12" class="outline-2">
<h2 id="orgc84cd12">Knowing What You Don't Know (KYDK) And Getting The Bare Minimum (GTBM) Best Detail</h2>
<div class="outline-text-2" id="text-orgc84cd12">
<p>
Be smart to identify knowledge gaps and fill them optimally
</p>
</div>

<div id="outline-container-orgc8be4cb" class="outline-3">
<h3 id="orgc8be4cb">Introduction</h3>
<div class="outline-text-3" id="text-orgc8be4cb">
<ul class="org-ul">
<li>Importance of recognizing "unknown unknowns"</li>
<li>Why attention to detail &amp; product knowledge matter in sales</li>
<li>Quick context: diverse complex used machinery, no technical background still sales can close.</li>
</ul>
</div>
</div>

<div id="outline-container-org60a07b2" class="outline-3">
<h3 id="org60a07b2">Understanding Your Knowledge Gaps</h3>
<div class="outline-text-3" id="text-org60a07b2">
<ul class="org-ul">
<li>What you don't know vs what you think you know</li>
<li>Identifying critical unknowns affecting immediate tasks (sales calls, deal negotiation calls, visits, handovers)</li>
<li>Prioritize knowledge needs by impact on problem solving &amp; closing deals</li>
</ul>
</div>
</div>

<div id="outline-container-orgab68547" class="outline-3">
<h3 id="orgab68547">How To Get The Bare Minimum Best Detail</h3>
<div class="outline-text-3" id="text-orgab68547">
<ul class="org-ul">
<li>Leverage team leader expertise effectively (ask targeted questions, take help only when truly necessary, until then be the authority)</li>
<li>ask the right bare minimum questions to the right stakeholder to GTBM</li>
</ul>
</div>
</div>

<div id="outline-container-orge1878ce" class="outline-3">
<h3 id="orge1878ce">Applying Information Smartly To Current Problems</h3>
<div class="outline-text-3" id="text-orge1878ce">
<ul class="org-ul">
<li>Quick assimilation &amp; summarization of all available details.</li>
<li>Build checklist or cheat sheet for frequent sales points &amp; objections</li>
<li>be attentive listen, watch, learn what others are doing.</li>
</ul>
</div>
</div>

<div id="outline-container-org6d9c32a" class="outline-3">
<h3 id="org6d9c32a">Developing Sales Competence &amp; Soft Skills</h3>
<div class="outline-text-3" id="text-org6d9c32a">
<ul class="org-ul">
<li>Focus on empathy: listening more, asking right questions</li>
<li>Building rapport &amp; trust quickly</li>
<li>Negotiation techniques to close deals (understand needs, offer solutions)</li>
<li>Handling objections calmly with a solutions mindset</li>
</ul>
</div>
</div>

<div id="outline-container-orga7a82f4" class="outline-3">
<h3 id="orga7a82f4">Boosting Technological Competence</h3>
<div class="outline-text-3" id="text-orga7a82f4">
<ul class="org-ul">
<li>Basic shortcuts and tech tools for efficiency (WhatsApp, Google Lens, Evernote)</li>
<li>Using tech to speed up product knowledge acquisition &amp; sharing</li>
<li>Encourage continuous learning culture in team</li>
<li>Use WhatsApp productivity tips:
<ul class="org-ul">
<li>Typing shortcuts: text replacement, voice in keyboard to type faster, using the control key for easy word manipulations faster.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2b44b5d" class="outline-3">
<h3 id="org2b44b5d">Hierarchy Of Problem Solving Based On Details Known</h3>
<div class="outline-text-3" id="text-org2b44b5d">
<ul class="org-ul">
<li>Tier 1: Solving basic customer queries using existing knowledge + cheat sheets</li>
<li>Tier 2: Handling technical objections by quick, accurate detail retrieval, confirmal with owners, noting them</li>
<li>Tier 3: having complete technical knowledge, having the best customer relations, planning way ahead considering all possible and tail events and to safeguard events accordingly. optimal thinking and usage of all available resources.</li>
<li>Importance of escalating intelligently &amp; timely communication</li>
</ul>
</div>
</div>

<div id="outline-container-org3c17605" class="outline-3">
<h3 id="org3c17605">take fast decisions based on the current set of available set of information. and keep on adapting as the situation unfolds and gives more details to the current problem.</h3>
<div class="outline-text-3" id="text-org3c17605">
<ul class="org-ul">
<li>be ready to fail in taking such decision.</li>
<li>"Wait like a cat, silent and patient; strike like a cheetah, fast and precise."</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>